// Домашнє завдання №3.

// Написати на Java Script код для вирішення наступних завдань:

// 1. За допомогою циклу знайдіть суму чисел від 1 до 100.
// 2. Даний масив з елементами 2, 5, 9, 15, 0, 4. За допомогою циклу for та оператора if
// виведіть на екран стовпець тих елементів масиву, які більше трьох, але
// менше ніж 10.
// 3. Даний масив з елементами 1, 2, 5, 9, 4, 13, 4, 10. За допомогою циклу for та
// оператора if перевірте, чи є в масиві елемент зі значенням, рівним 4.
// Якщо є – виведіть на екран 'Є!' і вийдіть із циклу. Якщо ні – нічого
// робити не треба.

// Результат домашнього завдання (файли з рішеннями) прикріпити до домашнього завданням.