// Домашнє завдання №3.

// Написати на Java Script код для вирішення наступних завдань:

// 1. За допомогою циклу знайдіть суму чисел від 1 до 100.
// 2. Даний масив з елементами 2, 5, 9, 15, 0, 4. За допомогою циклу for та оператора if
// виведіть на екран стовпець тих елементів масиву, які більше трьох, але
// менше ніж 10.
// 3. Даний масив з елементами 1, 2, 5, 9, 4, 13, 4, 10. За допомогою циклу for та
// оператора if перевірте, чи є в масиві елемент зі значенням, рівним 4.
// Якщо є – виведіть на екран 'Є!' і вийдіть із циклу. Якщо ні – нічого
// робити не треба.

// Результат домашнього завдання (файли з рішеннями) прикріпити до домашнього завданням.

// Завдання 1: Знаходження суми чисел від 1 до 100
// let sum = 0;
// for (let i = 1; i <= 100; i++) {
//     sum += i;
// }
// console.log("Сума чисел від 1 до 100: " + sum);

// Завдання 2: Виведення елементів масиву, більших за 3 та менших за 10
// const arr1 = [2, 5, 9, 15, 0, 4];
// console.log("Елементи масиву більше 3 та менше 10:");
// for (let i = 0; i < arr1.length; i++) {
//     if (arr1[i] > 3 && arr1[i] < 10) {
//         console.log(arr1[i]);
//     }
// }
// Завдання 3: Перевірка наявності елемента зі значенням 4 в масиві
// const arr2 = [1, 2, 5, 9, 4, 13, 4, 10];
// console.log("Перевірка наявності елемента зі значенням 4 в масиві:");
// for (let i = 0; i < arr2.length; i++) {
//     if (arr2[i] === 4) {
//         console.log('Є!');
//         break; // Вихід з циклу, якщо знайдено елемент зі значенням 4
//     }
// }



// for (i = 0; i < 5; i++) {
//     console.log(i);
// }


// function showMessage() {
//     alert("ПРивіт друзі");
// }

// showMessage();



// function sum(a, b) {
//     return a - b
// }

// const test = sum (10, 5)
// console.log(test);

