// Зовнішні скрипти

// Якщо Вам необхідно вставити великий JavaScript-код, його потрібно винести в
// окремий файл.Далі цей файл підключається до HTML:

// <script type="module" src="/lessons_1/js-01-script.js"></script>
    
// У нашому випадку /lessons_1/js-01-script.js – це шлях до файлу, що містить скрипт (з кореня)
// сайту).

//Тег <script></script> пишиться перед закриваючим тегом </body>

// Після цього браузер сам скачає скрипт і виконає його.

// Браузер, парсить код з верху вниз, коли зчитує <script>:
// 1. Відображає сторінку, показує частину документа до тега script.
// 2. Побачивши цей тег, перемикається в JavaScript-режим та виконує його
// вміст.
// 3. Після виконання повертається назад у HTML-режим і лише тоді
// відображає решту документа

