// Домашне завдання №1

// 1. Створіть головну сторінку index.html;
// 2. Створіть файл скрипту code.js;
// 3. Підключіть файл до HTML коду;
// 4. Додати в Java Script-код команди для:
//    • створення змінних з Вашим ім'ям, прізвищем та віком;
//    • виведення Ваших імені, прізвища та віку.
// 5. Результат у вигляді архіву прикріпити до домашнього завдання.
    
    
// /В index.html підключенний скрипт перед закриваючим тегом </body>
// <script src="/code.js"></script>

// В файлі code.js: Створення змінних
// const myName = "Ваше_ім'я";
// const mySurname = "Ваше_прізвище";
// const myAge = Ваш_вік;

// Виведення даних в консоль
// console.log("Ім'я: ", myName);
// console.log("Прізвище: ", mySurname);
// console.log("Вік: ", myAge);

// Замініть "Ваше_ім'я", "Ваше_прізвище" і Ваш_вік відповідно вашими реальними даними.

// Після цього завантажте обидва файли (Index.html і Code.js) та утворіть 
// архів з цими файлами. Прикріпіть архів до вашого домашнього завдання. 
