// - змінні (приклад з коробкою)
// - const і let
// - логування з console.log() виявити баги

// const age = 15;
// const totalPrice = 327.45;
// const userName = "Анна";
// const message1 = "Привіт";
// const isOpen = true; // форма відкрита
// const checked = false; //поле форми не містить галочки

// console.log(age);
// console.log('Ціна:', totalPrice);


// const
// -Змінну повинні відразу ініцілізувати якимсь значенням, щось записати.
// - Змінна яка була об'явленна через const в неї не можна записати інше значення.

// let
// -Змінні які будуть змінюватися в коді скрипта, будуть нові значення. (сума товара, день народження зміна віку)

// let message; //let - сума товара, зміна віку
//     message = 'Привіт!';
//     message = 'Світ!'; // значення можна змінювати багато разів
//     // alert(message);
//     console.log(message);
