// Домашнє завдання №4.

// 1. Створити таку форму в HTML:


// Зразок в папці img


// 2. Написати для неї такий JavaScript-код, щоб при завантажуванні сторінки числа
// a та b генерувались випадково.
// 3. Після натискання на кнопку виводиться повідомлення “Правильно/Неправильно” в
// залежності від того чи була введена правильна відповідь.
// 4. Результат прикріпити до домашнього завдання.
    
// Додатково: можна дописати програму так, щоб вівся рахунок правильних
// відповідей, і після однієї відповіді одразу генерувалося інше завдання.