$(document).ready(function(){
    $(".btn-slide").click(function(){
        $("#panel").slideToggle("slow");
        $(this).toggleClass("active");
        return false;
    });
});

// $(document).ready(function(){...});      Цей рядок виконується, коли весь документ готовий до маніпулювання DOM. Функція, передана як аргумент, виконується при завершенні завантаження сторінки.
// $(".btn-slide").click(function(){...});  Цей рядок додає обробник події кліку до всіх елементів з класом .btn-slide. Функція, передана як аргумент, буде виконуватися при кліку на будь-який з цих елементів.
// $("#panel").slideToggle("slow");         Цей рядок здійснює згортання або розгортання елементу з ідентифікатором panel. Функція slideToggle() забезпечує анімований ефект згортання/розгортання елементу з плавним перехідом.
// $(this).toggleClass("active");           Цей рядок додає або видаляє клас "active" з елементу, на який клікнули (.btn-slide). Це дозволяє змінювати стиль кнопки при кліку на неї.
// return false;                            Цей рядок забороняє перехід за посиланням, щоб клік не викликавав додаткових дій за замовчуванням.



$(document).ready(function(){
    $(".run").click(function(){
        $("#box").animate({opacity: 0.1, left: "+=400"}, 1200)
                .animate({opacity: 0.4, left: "+=160", height: 20, width: 20}, "slow")
                .animate({opacity: 1, left: 0, height: 100, width: 100}, "slow")
                .animate({ top: 0}, "fast")
                .slideUp()
                .slideDown("slow");
        return false;
    });
});


// $(document).ready(function(){...});  Цей рядок виконується, коли весь документ готовий до маніпулювання DOM. Функція, передана як аргумент, виконується при завершенні завантаження сторінки.
// $(".run").click(function(){...});    Цей рядок додає обробник події кліку до всіх елементів з класом .run. Функція, передана як аргумент, буде виконуватися при кліку на будь-який з цих елементів.
// $("#box").animate({opacity: 0.1, left: "+=400"}, 1200)  Цей рядок здійснює анімоване переміщення та зміну прозорості елементу з ідентифікатором box. Елемент зміщується вправо на 400 пікселів, його прозорість зменшується до 0.1 за 1200 мілісекунд.
// .animate({...}, "slow")              Цей рядок здійснює анімовану зміну розміру та розташування елементу box за допомогою ефекту "slow".
// .slideUp()                           Цей рядок здійснює анімоване згортання елементу box.
// .slideDown("slow")                   Цей рядок здійснює анімоване розгортання елементу box за допомогою ефекту "slow".
// return false;                        Цей рядок забороняє перехід за посиланням, щоб клік не викликавав додаткових дій за замовчуванням.



$( "p" ).on( "click", function() {
    $( this ).slideUp();
});
  

// $( "p" )                            Цей рядок використовує jQuery для вибору всіх елементів <p> на сторінці. jQuery використовує CSS-подібний синтаксис для вибору елементів, тому "p" означає всі елементи <p> на сторінці.
// .on( "click", function() { ... } )  Цей рядок встановлює обробник подій для всіх вибраних елементів, який відбувається при кліку на них. У цьому випадку, коли клікають на елементи <p>, буде викликана функція.
// $( this )                           Цей рядок створює jQuery-об'єкт з поточного елемента, на якому відбулася подія (у цьому випадку, це елемент <p>, на який клікнули).
// .slideUp()                          Цей рядок викликає анімацію згортання елементу вгору. У цьому випадку, елемент <p>, на який клікнули, буде згорнутий вгору і зникне з виду після кліку.




/*------homework------ */

$(document).ready(function(){
    $("#toggleBtn").click(function(){
        $(".content").slideToggle();     
    });
});

// $(document).ready(function(){...});      Цей рядок виконується, коли весь документ готовий до маніпулювання DOM. Функція, передана як аргумент, виконується при завершенні завантаження сторінки.
// $("#toggleBtn").click(function(){...});  Цей рядок додає обробник події кліку до елемента з ідентифікатором toggleBtn. Функція, передана як аргумент, буде виконуватися при кліку на цей елемент.
// $(".content").slideToggle();             Цей рядок виконує згортання або розгортання елементів з класом .content. Функція slideToggle() забезпечує анімований ефект згортання/розгортання елементів.
//                                           Коли елементи згортаються, вони стають невидимими, а коли розгортаються - стають видимими.



$(document).ready(function(){
    $("#hideBtn").click(function(){
        $(".content2").toggle(); 
    });
});

// $(document).ready(function(){...});      Цей рядок виконується, коли весь документ готовий до маніпулювання DOM. Функція, передана як аргумент, виконується при завершенні завантаження сторінки.
// $("#hideBtn").click(function(){...});    Цей рядок додає обробник події кліку до елемента з ідентифікатором hideBtn. Функція, передана як аргумент, буде виконуватися при кліку на цей елемент.
//     $(".content2").toggle();             Цей рядок виконує ховання або відображення елементів з класом.content2.Функція toggle() забезпечує зміну видимості елементів.Коли елементи вже відображені,
//                                          вони стануть невидимими, а коли приховані - стануть видимими.







