// Домашнє завдання №6.

// 1. Оформіть такий HTML-документ (рис. 1) та напишіть код на jQuery для
// згортання контенту.
    
// згорнути розгорнути

// 1. пункт списку
// 2. пункт списку
// 3. пункт списку
// 4. пункт списку
// 5. пункт списку
// 6. пункт списку
// 7. пункт списку
// 8. пункт списку
// 9. пункт списку
// 10. пункт списку
// 11. пункт списку
// 12. пункт списку
// 13. пункт списку
// 14. пункт списку
// 15. пункт списку
// 16. пункт списку

//     Мал. 1

// 2. Оформіть такий HTML-документ (рис. 2) та напишіть код на jQuery для
// ховати контент.

// зникнути з'явитися

// 1. пункт списку
// 2. пункт списку
// 3. пункт списку
// 4. пункт списку
// 5. пункт списку
// 6. пункт списку
// 7. пункт списку
// 8. пункт списку
// 9. пункт списку
// 10. пункт списку
// 11. пункт списку
// 12. пункт списку
// 13. пункт списку
// 14. пункт списку
// 15. пункт списку
// 16. пункт списку

//     Мал. 2

// 3. Результат прикріпити до домашнього завдання.