// Домашнє завдання №6.

// 1. Оформіть такий HTML-документ  та напишіть код на jQuery для
// згортання контенту.
    

//  Згортання контенту.
// 1. пункт списку
// 2. пункт списку
// 3. пункт списку
// 4. пункт списку
// 5. пункт списку
// 6. пункт списку
// 7. пункт списку
// 8. пункт списку
// 9. пункт списку
// 10. пункт списку
// 11. пункт списку
// 12. пункт списку
// 13. пункт списку
// 14. пункт списку
// 15. пункт списку
// 16. пункт списку



// 2. Оформіть такий HTML-документ та напишіть код на jQuery для
// ховати контент.

// Зникнути з'явитися

// 1. пункт списку
// 2. пункт списку
// 3. пункт списку
// 4. пункт списку
// 5. пункт списку
// 6. пункт списку
// 7. пункт списку
// 8. пункт списку
// 9. пункт списку
// 10. пункт списку
// 11. пункт списку
// 12. пункт списку
// 13. пункт списку
// 14. пункт списку
// 15. пункт списку
// 16. пункт списку


// 3. Результат прикріпити до домашнього завдання.