// confirm() - виводить модальне вікно з повідомленням, і дві кнопки, Ok і Cancel.Натискаючи на Ok,
//     результатом будет true, натискаючи на Cancel - повертається false.

// Просимо клієнта підтвердити бронювання велосипеда
// і зберігаємо результат роботи confirm у змінну
// const isComing = confirm("Вам є 18 років?");
// console.log(isComing);


// prompt() - виводить модальне вікно з полем введення і кнопками Ok і Cancel.Натискаючи на Ok,
//     результатом буде те, що ввів користувач, у випадку Cancel - повертається null.

// Запитуємо назву велописипеда, на якому хотіли покататися
// і зберігаємо результат виклику prompt у змінну.
// const bikelName = prompt("Please enter desired baki name", ""); // якщо не поставити другі пусті лапки (аргумент) то prompt працює не правельно
// console.log(bikelName);