// Домашнє завдання №2.

// 1. Написати код на JavaScript, який буде:
// Запитувати у користувача ім'я, прізвище та вік. Після чого
// відповідатиме: "Привіт [Ім'я] [Прізвище]". А потім буде
// казати: "Ви повнолітній (не повнолітній)" залежно від
// залежно від віку користувача.
// 2. Результат прикріпити до домашнього завдання

// Запитуємо у користувача ім'я
// const ім'я = prompt("Введіть ваше ім'я:");

// Запитуємо у користувача прізвище
// const прізвище = prompt("Введіть ваше прізвище:");

// Запитуємо у користувача вік
// const вік = prompt("Введіть ваш вік:");

// Виводимо привітання з ім'ям і прізвищем
// console.log("Здрастуйте " + ім'я + " " + прізвище);

// Перевіряємо чи користувач повнолітній
// if (вік >= 18) {
//     console.log("Ви повнолітній");
// } else {
//     console.log("Ви не повнолітній");
// }

// const name = prompt("Введіть ваше ім'я:", "");
// const surName = prompt("Введіть ваше прізвище:", "");
// const age = prompt("Введіть ваш вік:", "");

// console.log("Привіт " + name + " " + surName);

// if (age >= 18) {
//   console.log("Ви повнолітній");
// } else {
//   console.log("Ви не повнолітній");
// }
