// Домашнє завдання №7.

// Напишіть на JavaScript код, і в ньому:
// 1. Заповніть масив таким чином: у перший елемент запишіть 'x',
// другий 'xx', третій 'xxx' і так далі.
// 2. Створіть функцію arrayFill, яка заповнюватиме масив заданими
// значеннями. Першим параметром функція набуває значення, яким
// заповнювати масив, а другим - скільки елементів має бути в масиві.
// Приклад: arrayFill('x', 5) зробить масив ['x', 'x', 'x', 'x', 'x'].
// 3. Коли створено масив з числами, дізнайтеся скільки елементів від початку
// масиву потрібно скласти, щоб у сумі вийшло більше 10-ти.
// 4. Результат прикріпити до домашнього завдання.